# knowledge_base.py

# Пример базы знаний в виде списка ответов
knowledge_base = [
    "|ТК 'ALPHA cargo' цена доставка Москва: Пошив - 1кг 50₽, Привозные - 1кг 55₽, Маркировка - 1кг 65₽, Бренд - 1кг 65₽, Адрес склада в Москве: Г. Москва, Джержинский, ул. Энергетиков 30, строение 2. Сроки доставки 5-7 дней. Если товар не превышает 10кг, то ставится фиксированная стоимость доставки 1000 ₽.",
    "|Цена доставка Екатеринбург: Пошив - 1кг 50р, Привозные - 1кг 50р, Маркировка - 1кг 65р, Бренд - 1кг 65р. Сроки доставки +- 8 дней.",
    "|В Узбекистан и Таджикистан товар отправляем через частные карго (Абу-Сахи). Доставка стоит 3,5$ за один килограмм, если вес груза не достигает 20кг. Если товар весит больше 20кг, доставка за один килограмм будет стоить 3$. Сроки доставки +-7 дней.",
    "|Цена доставка карго до Уфы: Прайс за 1кг: Пошив, Ткани - 40 рублей, Китай - 50 рублей, Маркировка - 50 рублей (менее 50кг за 1 место - 70 рублей), Бренд - 50 рублей, Турция - 60 рублей.",
    "|Цена доставка Самара: Пошив - 1кг 55₽, Привозные - 1кг 55₽, Маркировка - 1кг 65₽, Бренд - 1кг 65₽, Обувь - 1кг 100₽. Сроки доставки 6-7 дней. Если товар не превышает 10кг, то ставится фиксированная стоимость доставки 1000 ₽.",
    "|Цена доставка Казань: Пошив - 1кг 45₽, Привозные - 1кг 55₽, Маркировка - 1кг 65₽, Бренд - 1кг 65₽. Сроки доставки 7-8 дней. Если товар не превышает 10кг, то ставится фиксированная стоимость доставки 1000 ₽.",
    "|Цена доставка Красноярск: Пошив - 1кг 55р, Привозные - 1кг 65р, Маркировка - 1кг 85р, Бренд - 1кг 85р, Обувь - 1кг 105р. Адрес: г. Красноярск, проспект Газеты «Красноярский Рабочий» 27, строение 70, ТК «Восточный».",
    "|Прямая доставка РоссКарго. Г. Ростов-на-Дону: Пошив - 1кг 55 ₽, Китай, Турция - 70 ₽, Бренд, Маркировка - 1кг 70₽, Спец. форма - 1кг 60₽, Обувь - 1кг 100₽. Сроки доставки +-7 дней.",
    "|Доставка по Казахстану: частные перевозчики. Западный Казахстан ±3-5 дней, центральный Казахстан ±1-4 дня, восточный Казахстан 1-3 дня. Цена зависит от объема.",
    "|Обувь выкупаем и отправляем. Однако при доставке в ТК коробку либо саму обувь могут немного помять. Уточняйте тарифы у администратора. На обувь цена за доставку выше из-за объема.",
    "|В Дагестан, Сочи, Махачкалу, Пятигорск, Хасавюрт, Грозный, Чечню груз отправляем через Москву.",
    "|Курс рубля = 0,95 сома. Курс доллара = 86 сом. Курс тенге = 0.196 сома.",
    "|Честный знак возможен. Прайс (цена) фуллфилмента (ФФ): https://docs.google.com/spreadsheets/d/1C7Ik1OxD_Bsrkb43IqaBNK_QHQw9Byk8ZcnYVJ58Y0A/edit?usp=drivesdk",
    "|Условия заказа / комиссия за услуги: организационный сбор. Нет ограничения по сумме, от 1 упаковки (линией). До $99 - фиксированная комиссия 600 сом. От $140 - 6% от суммы перевода (не израсходованный остаток - не учитывается). От $999 - торгуемо (учитывается сложность заказа). Выше $1999 - на усмотрение клиента в нижних пределах рыночных цен. Дополнительно: сохранность денежных средств и выкупленного товара гарантируется коллективом (команда из более 150 человек) Дордой Фэшн - только в случае перевода / исполнения заказа в рабочем чате заказчика (WhatsApp & Telegram) в присутствии номера wa.me/996500996500.",
    "|ТК ALPHA cargo цена доставка Новосибирск: Пошив - 1кг 50₽, Привозные - 1кг 55₽, Маркировка - 1кг 65₽, Бренд - 1кг 65₽. Адрес: г. Новосибирск, Территория СНТ Весна Сибири, 65, ТК «Восток». Сроки доставки 7-8 дней. Если товар не превышает 10кг, то ставится фиксированная стоимость доставки 1000 ₽.",
    "Если у вас возникнут дополнительные вопросы, не стесняйтесь обратиться к администратору по номеру +996 705 705 996."
]
